Ran Plan for 2 projects:

1. dir: `non-prod/sgp-southeast-1/dev/eks` workspace: `non-prod_sgp-southeast-1_dev_eks`
1. dir: `non-prod/sgp-southeast-1/dev/ec2` workspace: `non-prod_sgp-southeast-1_dev_ec2`

### 1. dir: `non-prod/sgp-southeast-1/dev/eks` workspace: `non-prod_sgp-southeast-1_dev_eks`
<details><summary>Show Output</summary>

```diff
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

time=2023-03-31T04:55:37+08:00 level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/jiangguoqing/my-iac3/12/non-prod_sgp-southeast-1_dev_eks/provider/ec2. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (signed by HashiCorp)

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0a72af05d27b49ccb"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "test1"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/sgp-southeast-1/dev/eks -w non-prod_sgp-southeast-1_dev_eks`
* :put_litter_in_its_place: To **delete** this plan click [here](https://0019-167-71-217-162.ap.ngrok.io/lock?id=jiangguoqing%252Fmy-iac3%252Fnon-prod%252Fsgp-southeast-1%252Fdev%252Feks%252Fnon-prod_sgp-southeast-1_dev_eks)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/sgp-southeast-1/dev/eks -w non-prod_sgp-southeast-1_dev_eks`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `non-prod/sgp-southeast-1/dev/ec2` workspace: `non-prod_sgp-southeast-1_dev_ec2`
<details><summary>Show Output</summary>

```diff
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

time=2023-03-31T04:55:37+08:00 level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/jiangguoqing/my-iac3/12/non-prod_sgp-southeast-1_dev_ec2/provider/ec2. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (signed by HashiCorp)

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
aws_instance.web: Refreshing state... [id=i-09f946df634746c98]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.web will be updated in-place
  ~ resource "aws_instance" "web" {
        id                           = "i-09f946df634746c98"
      ~ tags                         = {
          ~ "Name" = "test" -> "test1"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/sgp-southeast-1/dev/ec2 -w non-prod_sgp-southeast-1_dev_ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://0019-167-71-217-162.ap.ngrok.io/lock?id=jiangguoqing%252Fmy-iac3%252Fnon-prod%252Fsgp-southeast-1%252Fdev%252Fec2%252Fnon-prod_sgp-southeast-1_dev_ec2)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/sgp-southeast-1/dev/ec2 -w non-prod_sgp-southeast-1_dev_ec2`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
